app/controllers/comments_controller.rb

def create
  @comment = Comment.create(comment_params)
---
INSERT INTO `comments` (`user_id`, `facility_id`, `text`, `created_at`, `updated_at`) VALUES (104, 3, 'コメント３4', '2019-03-29 11:48:50', '2019-03-29 11:48:50')

  def set_facility
      @facility = Facility.find(params[:facility_id])
---
SELECT  `facilities`.* FROM `facilities` WHERE `facilities`.`id` = 3 LIMIT 1