app/controllers/facilities_controller.rb

SELECT  `facilities`.* FROM `facilities` LIMIT 5 OFFSET 0
SELECT COUNT(DISTINCT `facilities`.`id`) FROM `facilities`
---
  def index
    @facilities = Facility.page(params[:page]).per(5)

SELECT  `facilities`.* FROM `facilities` WHERE `facilities`.`id` = 6 LIMIT 1
SELECT `comments`.* FROM `comments` WHERE `comments`.`facility_id` = 3
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 102 ORDER BY `users`.`id` ASC LIMIT 1
---
  def show
    @facility = Facility.find(params[:id])
    @comments = @facility.comment.includes(:user)

INSERT INTO `facilities` (`name`, `description`, `address`, `created_at`, `updated_at`) VALUES ('サウナ７７', 'なし', '鹿児島県', '2019-01-20 09:16:46', '2019-01-20 09:16:46')
---
  def create
    @facility = Facility.new(facility_params)
    if @facility.save

SELECT  `facilities`.* FROM `facilities` WHERE `facilities`.`id` = 1 LIMIT 1
---
  def edit
    @facility = Facility.find(params[:id])

SELECT  `facilities`.* FROM `facilities` WHERE `facilities`.`id` = 1 LIMIT 1
UPDATE `facilities` SET `name` = 'サウナKK', `description` = 'KKサウナです', `address` = '石川県KK', `updated_at` = '2019-01-26 03:22:55' WHERE `facilities`.`id` = 2
---
  def update
    @facility = Facility.find(params[:id])
    @facility.update!(facility_params)

SELECT  `facilities`.* FROM `facilities` WHERE `facilities`.`id` = 2 LIMIT 1
DELETE FROM `facilities` WHERE `facilities`.`id` = 2
---
  def destroy
    facility = Facility.find(params[:id])
    facility.destroy