app/controllers/facilities_controller.rb

UPDATE `facilities` SET `updated_at` = '2019-02-10 11:48:21' WHERE `facilities`.`id` = 109
---
  def update
    facility = Facility.find(params[:id])
    facility.update!(facility_params)