app/controllers/favorites_controller.rb

INSERT INTO `favorites` (`user_id`, `facility_id`, `created_at`, `updated_at`) VALUES (102, 109, '2019-02-21 12:05:52', '2019-02-21 12:05:52')
---
  def create
    @favorite = Favorite.create(user_id: current_user.id, facility_id: params[:facility_id])

SELECT  `favorites`.* FROM `favorites` WHERE `favorites`.`user_id` = 102 AND `favorites`.`facility_id` = 2 LIMIT 1
DELETE FROM `favorites` WHERE `favorites`.`id` = 2
---
  def destroy
    favorite = Favorite.find_by(user_id: current_user.id, facility_id: params[:facility_id])
    favorite.destroy

SELECT  `facilities`.* FROM `facilities` WHERE `facilities`.`id` = 109 LIMIT 1
---
  def set_facility
    @facility = Facility.find(params[:facility_id])