app/controllers/home_controller.rb

SELECT  `facilities`.* FROM `facilities` LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM `facilities`
SELECT  `comments`.* FROM `comments` LIMIT 5 OFFSET 0
---
  def index
      @facilities = Facility.page(params[:page]).per(5)
      @comments = Comment.page(params[:page]).per(5)